
echo "-----------------------------------------------------------------"
echo "                        Minecraft服务器                            "               
echo "                        服务器即将开启！"
echo ""
echo "          注意:关闭服务器前请在后台输入stop保存玩家数据"
echo "                     否则可能会出现回档情况"
echo "                      Powered by TECHZJC!"
echo "-----------------------------------------------------------------"
read -n 1 -p "请按下任意键来启动服务器…………"
clear
echo "    "
echo "-----------------------------------------------------------------"
echo ""
echo ""
echo "                  服务器正在启动中,请稍等……"
echo ""
echo ""
echo "-----------------------------------------------------------------"
java -Xms1024M -Xmx1024M -jar forge-1.12.2-14.23.4.2708-universal.jar nogui
echo ""
echo "-----------------------------------------------------------------" 
echo "             Minecraft --- 玩家数据保存完毕 已关服"
echo ""
echo "                        按任意键关闭该窗口"
echo " -----------------------------------------------------------------"
read -n 1 -p ""
clear
exit;
